[
  {
    "pk": 1, 
    "model": "flatpages.flatpage", 
    "fields": {
      "registration_required": false, 
      "title": "Home", 
      "url": "/", 
      "template_name": "", 
      "sites": [
        3, 
        2, 
        1
      ], 
      "content": "#Code Sport#\r\n\r\nCode Sport is a web based project for coding contests, built for automation of most of the tasks from code submission to evaluation.  \r\n\r\nFeatures:  \r\n\r\n - A Simple content management system for Problems and Submissions. \r\n - An inbuilt evaluator supporting: C, C++, Java.  \r\n - Support for distributed computing and queuing through [celery](http://celeryproject.org/).  \r\n - Simple API to plug in a different evaluator.  \r\n - A ticketing (querying) system. \r\n\r\n", 
      "enable_comments": false
    }
  }, 
  {
    "pk": 2, 
    "model": "flatpages.flatpage", 
    "fields": {
      "registration_required": false, 
      "title": "About", 
      "url": "/main/about/", 
      "template_name": "", 
      "sites": [
        3, 
        2, 
        1
      ], 
      "content": "In penatibus et odio odio placerat. Tincidunt nec lectus elementum turpis! Urna risus nisi, urna vel amet porta, urna sagittis, a rhoncus sed dictumst! Urna enim sociis? Tempor, dictumst sagittis integer tristique, massa a scelerisque velit, nisi mauris massa integer? Ut tincidunt? A scelerisque nunc tristique porta mus, magna, sociis porttitor in mattis dictumst? Facilisis turpis parturient, platea. Porta ac ultrices mid montes turpis enim magna mus ac in tristique! Magnis ultricies, sit porta diam, elit augue eu? Natoque sit ultrices nec enim odio. Nunc, augue augue in elementum dictumst! Proin mauris! Placerat mid placerat? Ridiculus, in non tincidunt ac.\r\n\r\nDignissim vut scelerisque phasellus scelerisque ac eros? Lorem dignissim, tristique ultrices, non aliquam? Tristique nascetur amet sed tincidunt vut adipiscing sed ac dapibus, tincidunt urna! Sagittis. Urna ac augue! Pid dis, proin, tincidunt augue, risus integer urna. Cum magnis aliquet nascetur tempor sociis. Ut lacus? Est cum elementum parturient aenean sagittis? Mauris pid amet rhoncus, ut tempor lundium amet, cum. In? Cursus turpis hac turpis turpis integer, sociis nec vut non hac facilisis amet mus aliquet vel facilisis porta, penatibus augue eros turpis parturient, ridiculus a. Duis non! Lacus mus, porta velit rhoncus nisi. Eros egestas placerat integer nascetur.\r\n\r\nPlacerat, penatibus odio magna dolor facilisis, facilisis? Turpis nec? Et urna ac porta ultrices cum. Phasellus nisi aliquet lundium. Tincidunt cras est auctor dapibus parturient dolor cursus in nunc enim magna mauris dignissim, tincidunt placerat adipiscing proin, quis in, dis mid rhoncus dolor rhoncus vel cursus magnis rhoncus, porta phasellus? Natoque magna ut, enim, dignissim? Platea, tincidunt magna vel, enim tristique cum pellentesque! Cum elementum urna elit ultricies est dapibus et, dis dapibus sagittis aliquam. Porta turpis et magna, rhoncus purus aliquet tincidunt mauris velit rhoncus velit? Placerat vut mattis nisi. Vel enim. Lundium vut, risus augue. Odio magna.", 
      "enable_comments": false
    }
  }, 
  {
    "pk": 2, 
    "model": "auth.user", 
    "fields": {
      "username": "admin", 
      "first_name": "Admin", 
      "last_name": "CodeSport", 
      "is_active": true, 
      "is_superuser": true, 
      "is_staff": true, 
      "last_login": "2011-02-05 02:52:50", 
      "groups": [], 
      "user_permissions": [], 
      "password": "sha1$648ae$8ef4921da8527205cda651d5ca8457ca2e19038d", 
      "email": "admin@example.com", 
      "date_joined": "2011-02-02 22:48:22"
    }
  }, 
  {
    "pk": 3, 
    "model": "auth.user", 
    "fields": {
      "username": "test", 
      "first_name": "Test", 
      "last_name": "User", 
      "is_active": true, 
      "is_superuser": false, 
      "is_staff": false, 
      "last_login": "2011-02-02 22:48:35", 
      "groups": [], 
      "user_permissions": [], 
      "password": "sha1$a3cd6$d0b882c8d0e685e08132a73861aada4817e27fd3", 
      "email": "test@example.com", 
      "date_joined": "2011-02-02 22:48:35"
    }
  }, 
  {
    "pk": 3, 
    "model": "sites.site", 
    "fields": {
      "domain": "127.0.0.1:8000", 
      "name": "127.0.0.1:8000"
    }
  }, 
  {
    "pk": 2, 
    "model": "sites.site", 
    "fields": {
      "domain": "localhost", 
      "name": "locahost"
    }
  }, 
  {
    "pk": 1, 
    "model": "sites.site", 
    "fields": {
      "domain": "localhost:8000", 
      "name": "localhost:8000"
    }
  }
]